Pokedex/app/views/pokemon/_pokemon.json.jbuilder

  json.toys do
    pokemon.toys.each do |toy|
---
SELECT "toys".* FROM "toys"  WHERE "toys"."pokemon_id" = $1  [["pokemon_id", 123]]